case3/TemplateCase-0.025/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
2500
(
(-0.490765 -0.245028 0.005)
(-0.470734 -0.245028 0.005)
(-0.450702 -0.245028 0.005)
(-0.430671 -0.245028 0.005)
(-0.41064 -0.245028 0.005)
(-0.390609 -0.245028 0.005)
(-0.370578 -0.245028 0.005)
(-0.350546 -0.245028 0.005)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.50078 -0.24503 0.005)
(-0.502337 -0.23509 0.005)
(-0.503886 -0.225148 0.005)
(-0.50542 -0.215205 0.005)
(-0.506932 -0.205258 0.005)
(-0.508419 -0.195307 0.005)
(-0.509873 -0.185351 0.005)
(-0.51129 -0.17539 0.005)
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(0.50078 -0.24503 0.005)
(0.502337 -0.23509 0.005)
(0.503886 -0.225148 0.005)
(0.50542 -0.215205 0.005)
(0.506932 -0.205258 0.005)
(0.508419 -0.195307 0.005)
(0.509873 -0.185351 0.005)
(0.51129 -0.17539 0.005)
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 0.25 0.005)
(-0.47 0.25 0.005)
(-0.45 0.25 0.005)
(-0.43 0.25 0.005)
(-0.41 0.25 0.005)
(-0.39 0.25 0.005)
(-0.37 0.25 0.005)
(-0.35 0.25 0.005)
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 -0.25 0.005)
(-0.47 -0.25 0.005)
(-0.45 -0.25 0.005)
(-0.43 -0.25 0.005)
(-0.41 -0.25 0.005)
(-0.39 -0.25 0.005)
(-0.37 -0.25 0.005)
(-0.35 -0.25 0.005)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
